exam1.org
#+TITLE: CS 141, Exam 1, Winter '21
#+OPTIONS: num:nil
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Note
- The example for Question 4 was wrong. The second part should have read today = 4, daysUntilExam = 22 should print: "Saturday". This was posted in slack.
* Solutions
** Question 1
| expression                                 | result | type    |
|--------------------------------------------+--------+---------|
| 7 * 3                                      |     21 | int     |
|--------------------------------------------+--------+---------|
| 14 % 3                                     |      2 | int     |
|--------------------------------------------+--------+---------|
| 15/3.0                                     |    5.0 | double  |
|--------------------------------------------+--------+---------|
| 3 + 1.9                                    |    4.9 | double  |
|--------------------------------------------+--------+---------|
| 7/3                                        |      2 | int     |
|--------------------------------------------+--------+---------|
| (2 + 5.0) - 2/5                            |    7.0 | double  |
|--------------------------------------------+--------+---------|
| "horse".charAt(3);                         |    's' | char    |
|--------------------------------------------+--------+---------|
| "teemo".equals("buteemosh".substring(2,5)) |  false | boolean |
|--------------------------------------------+--------+---------|
| "elephant"                                 |      8 | int     |
|--------------------------------------------+--------+---------|
** Question 2

