docs/exam1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
  <!-- 2021-02-16 Tue 22:28 -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii" />
  <meta name="viewport" content=
  "width=device-width, initial-scale=1" />

  <title>CS 141, Exam 1, Winter &rsquo;21</title>
  <meta name="generator" content="Org mode" />
  <meta name="author" content="Rik Bose" />
  <link rel="stylesheet" type="text/css" href=
  "https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css" />
  <link rel="stylesheet" type="text/css" href=
  "https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css" />

</head>

<body>
  <div id="content">
    <h1 class="title">CS 141, Exam 1, Winter &rsquo;21</h1>

    <div id="table-of-contents">
      <h2>Table of Contents</h2>

      <div id="text-table-of-contents">
        <ul>
          <li><a href="#org6cfeaf6">Note</a></li>

          <li>
            <a href="#org0270b45">Solutions</a>

            <ul>
              <li><a href="#org659aa47">Question 1</a></li>

              <li><a href="#orge343938">Question 2</a></li>

              <li><a href="#orgacbd47f">Question 3</a></li>

              <li><a href="#org5cc5a2a">Question 4</a></li>

              <li><a href="#org86ebdc3">Question 5</a></li>

              <li><a href="#org3015294">Question 6</a></li>

              <li><a href="#orgc313598">Question 7</a></li>

              <li><a href="#org6fe5a86">Question 8</a></li>

              <li><a href="#org71ac608">Question 9</a></li>
            </ul>
          </li>
        </ul>
      </div>
    </div>

    <div id="outline-container-org6cfeaf6" class="outline-2">
      <h2 id="org6cfeaf6">Note</h2>

      <div class="outline-text-2" id="text-org6cfeaf6">
        <ul class="org-ul">
          <li>The example for Question 4 was wrong. The second part
          should have read today = 4, daysUntilExam = 22 should
          print: &ldquo;Saturday&rdquo;. This was posted in
          slack.</li>
        </ul>
      </div>
    </div>

    <div id="outline-container-org0270b45" class="outline-2">
      <h2 id="org0270b45">Solutions</h2>

      <div class="outline-text-2" id="text-org0270b45"></div>

      <div id="outline-container-org659aa47" class="outline-3">
        <h3 id="org659aa47">Question 1</h3>

        <div class="outline-text-3" id="text-org659aa47">
          <table border="2" cellspacing="0" cellpadding="6" rules=
          "groups" frame="hsides">
            <colgroup>
              <col class="org-left" />
              <col class="org-right" />
              <col class="org-left" />
            </colgroup>

            <thead>
              <tr>
                <th scope="col" class="org-left">expression</th>

                <th scope="col" class="org-right">result</th>

                <th scope="col" class="org-left">type</th>
              </tr>
            </thead>

            <tbody>
              <tr>
                <td class="org-left">7 * 3</td>

                <td class="org-right">21</td>

                <td class="org-left">int</td>
              </tr>
            </tbody>

            <tbody>
              <tr>
                <td class="org-left">14 % 3</td>

                <td class="org-right">2</td>

                <td class="org-left">int</td>
              </tr>
            </tbody>

            <tbody>
              <tr>
                <td class="org-left">15/3.0</td>

                <td class="org-right">5.0</td>

                <td class="org-left">double</td>
              </tr>
            </tbody>

            <tbody>
              <tr>
                <td class="org-left">3 + 1.9</td>

                <td class="org-right">4.9</td>

                <td class="org-left">double</td>
              </tr>
            </tbody>

            <tbody>
              <tr>
                <td class="org-left">7/3</td>

                <td class="org-right">2</td>

                <td class="org-left">int</td>
              </tr>
            </tbody>

            <tbody>
              <tr>
                <td class="org-left">(2 + 5.0) - 2/5</td>

                <td class="org-right">7.0</td>

                <td class="org-left">double</td>
              </tr>
            </tbody>

            <tbody>
              <tr>
                <td class="org-left">
                &ldquo;horse&rdquo;.charAt(3);</td>

                <td class="org-right">&rsquo;s&rsquo;</td>

                <td class="org-left">char</td>
              </tr>
            </tbody>

            <tbody>
              <tr>
                <td class="org-left">
                &ldquo;teemo&rdquo;.equals(&ldquo;buteemosh&rdquo;.substring(2,5))</td>

                <td class="org-right">false</td>

                <td class="org-left">boolean</td>
              </tr>
            </tbody>

            <tbody>
              <tr>
                <td class="org-left">&ldquo;elephant&rdquo;</td>

                <td class="org-right">8</td>

                <td class="org-left">int</td>
              </tr>
            </tbody>
          </table>
        </div>
      </div>
